{
  "header": {
    "home": "Home",
    "about": "Sobre mim",
    "tech": "Tecnologias",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "home": {
    "welcome": "Bem-vindo",
    "iAm": "eu sou",
    "texts": [
      "Desenvolvedor Full Stack",
      "Apaixonado por tecnologia"
    ],
    "downloadCV": "Baixar CV",
    "portfolio": "Conheça meu portfólio →"
  },
  "about": {
    "title": "Sobre mim",
    "description": "Sou um desenvolvedor em formação, tenho 18 anos e curso Análise e Desenvolvimento de Sistemas na FIAP. Há 11 meses atuo na MRM McCann Worldgroup, contribuindo com equipes ágeis em projetos de inovação digital.\n\n Embora hoje meu foco esteja mais voltado ao front-end, com tecnologias como React e Next.js, também possuo experiência full stack adquirida em projetos acadêmicos e pessoais, especialmente com desenvolvimento back-end utilizando Node.js, Java, Python e Strapi.",
    "seeTechnologies": "Veja minhas tecnologias:",
    "experienceTitle": "Experiência Profissional",
    "experienceRole": "Desenvolvedor de Software - MRM McCann WorldGroup",
    "experienceClient": "Clientes: GM - Mastercard - Leroy Merlin - Diageo",
    "experienceDate": "Junho 2024 - Atual",
    "academicTitle": "Formação Acadêmica",
    "academicCourse": "Estudante de Análise e Desenvolvimento de Sistemas - FIAP",
    "academicInstitution": "Desenvolvimento Full Stack - Metodologias Ágeis",
    "academicDate": "Fevereiro 2024 - Dezembro 2025"
  },
  "technologies": {
    "title": "Tecnologias",
    "description": "Veja minha stack de habilidades e experiências em tecnologia:",
    "typescript": "JavaScript com tipagem estática, usado para maior segurança em projetos grandes.",
    "javascript": "Linguagem base da web, utilizada no front e back-end.",
    "react": "Biblioteca para criar interfaces modernas e reutilizáveis.",
    "next": "Framework React com SSR e foco em performance e SEO.",
    "tailwind": "Framework de classes utilitárias para estilização rápida e responsiva.",
    "node": "JavaScript no back-end para APIs, automações e servidores.",
    "java": "Linguagem orientada a objetos usada em sistemas robustos e Android.",
    "python": "Versátil, ideal para automações, back-end e ciência de dados.",
    "sql": "Linguagem de consulta de dados para bancos relacionais.",
    "aws": "Serviços em nuvem da Amazon para APIs, armazenamento e escalabilidade.",
    "azure": "Cloud da Microsoft com integração para apps corporativos.",
    "strapi": "CMS headless usado para criar e gerenciar APIs com agilidade."
  },
  "projects": {
    "title": "Projetos",
    "description": "Aqui você encontra alguns dos projetos mais relevantes que desenvolvi ao longo da minha jornada como desenvolvedor.",
    "titleProject1": "Plataforma de Economia com Energias Renováveis",
    "titleProject2": "Desenvolvimento LP - God of War Ragnarok",
    "titleProject3": "Monitoramento Inteligente de Ambientes Aquáticos",
    "titleProject4": "E-commerce",
    "titleProject5": "Sistema Bancário",
    "descriptionProject1": "A aplicação permite que usuários insiram seu consumo médio de energia elétrica e localização para receber uma estimativa personalizada de economia com energia solar.",
    "descriptionProject2": "Landing page temática inspirada no universo de God of War: Ragnarok, com foco em visual impactante e performance.",
    "descriptionProject3": "Desenvolvi um projeto que consistia na criação de um dispositivo inteligente para o monitoramento em tempo real de três parâmetros essenciais: Temperatura, pH da Água e Nível de Água.",
    "descriptionProject4": "Simulador de e-commerce com layout responsivo, onde o usuário pode visualizar produtos, adicionar ao carrinho e simular uma compra. ",
    "descriptionProject5": "O sistema permite criar contas, consultar saldo, realizar depósitos, saques e transferências via PIX. Utilizei enums para tipos de conta (CORRENTE, POUPANÇA, SALÁRIO) e status da conta (ATIVA, INATIVA).",
    "deploy": "Acessar deploy",
    "github": "Ver no Github"
  },
  "contact": {
    "title": "Contato",
    "description": "Vamos conversar! Estou aberto a parcerias e novos projetos.",
    "button": "Enviar mensagem",
    "placeholderTitle": "Título",
    "placeholderName": "Seu nome",
    "placeholderEmail": "Seu email",
    "placeholderMessage": "Messagem"
  },
  "footer": {
    "home": "Home",
    "about": "Sobre mim",
    "techs": "Tecnologias",
    "projects": "Projetos",
    "contact": "Contato",
    "textFooter": "2025 João Vitor da Silva. Todos os direitos reservados."
  }
}